# Single Customer View

**The Conception of Customer Single View**

- RFM

    - R: Recency (ex. last visit)
    - F: Frequency (ex. total visit) 
    - M: Monetary (ex. total spend)

for more information: https://medium.com/@thanachart.rit/building-customer-single-view-customer-360-3539c971092c

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('supermarket_data.csv')

In [3]:
df.head()

,SHOP_DATE,SHOP_HOUR,BASKET_ID,CUST_CODE,STORE_CODE,PROD_CODE,QUANTITY,SPEND
0,20071006,21,994107800268406,CUST0000153531,STORE00001,PRD0901391,1,0.37
1,20070201,15,994104300305853,CUST0000219191,STORE00002,PRD0901915,1,5.08
2,20071103,13,994108200514137,CUST0000526979,STORE00003,PRD0903379,1,2.36
3,20070206,18,994104400743650,CUST0000913709,STORE00004,PRD0903305,1,0.20
4,20071015,19,994108000780959,CUST0000961285,STORE00001,PRD0903387,1,1.65

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 671914 entries, 0 to 671913
Data columns (total 8 columns):
SHOP_DATE     671914 non-null int64
SHOP_HOUR     671914 non-null int64
BASKET_ID     671914 non-null int64
CUST_CODE     671914 non-null object
STORE_CODE    671914 non-null object
PROD_CODE     671914 non-null object
QUANTITY      671914 non-null int64
SPEND         671914 non-null float64
dtypes: float64(1), int64(4), object(3)
memory usage: 41.0+ MB

In [5]:
df.describe()

          SHOP_DATE      SHOP_HOUR     BASKET_ID       QUANTITY          SPEND
count  6.719140e+05  671914.000000  6.719140e+05  671914.000000  671914.000000
mean   2.007391e+07      14.745869  9.941078e+14       1.514344       1.852796
std    4.594496e+03       3.551738  2.286042e+09       1.668037       2.589564
min    2.007010e+07       8.000000  9.941039e+14       1.000000       0.010000
25%    2.007052e+07      12.000000  9.941058e+14       1.000000       0.750000
50%    2.007093e+07      15.000000  9.941077e+14       1.000000       1.210000
75%    2.008022e+07      17.000000  9.941098e+14       1.000000       2.040000
max    2.008071e+07      21.000000  9.941117e+14      73.000000     189.630000

In [6]:
df['SHOP_DATE'] = pd.to_datetime(df['SHOP_DATE'], format='%Y%m%d')

In [7]:
df.head()

,SHOP_DATE,SHOP_HOUR,BASKET_ID,CUST_CODE,STORE_CODE,PROD_CODE,QUANTITY,SPEND
0,2007-10-06,21,994107800268406,CUST0000153531,STORE00001,PRD0901391,1,0.37
1,2007-02-01,15,994104300305853,CUST0000219191,STORE00002,PRD0901915,1,5.08
2,2007-11-03,13,994108200514137,CUST0000526979,STORE00003,PRD0903379,1,2.36
3,2007-02-06,18,994104400743650,CUST0000913709,STORE00004,PRD0903305,1,0.20
4,2007-10-15,19,994108000780959,CUST0000961285,STORE00001,PRD0903387,1,1.65

In [8]:
df2 = df.groupby('CUST_CODE').SHOP_DATE.max()

In [9]:
df2

CUST_CODE
CUST0000000107   2008-03-25
CUST0000000369   2008-07-05
CUST0000001388   2008-04-11
CUST0000002302   2008-07-03
CUST0000002637   2008-05-30
CUST0000002638   2007-04-14
CUST0000002817   2008-06-16
CUST0000003044   2007-01-24
CUST0000003252   2008-04-04
CUST0000003287   2008-05-10
CUST0000003323   2007-08-29
CUST0000003679   2008-06-25
CUST0000003766   2007-01-29
CUST0000003953   2008-07-05
CUST0000004088   2008-06-29
CUST0000004250   2007-08-06
CUST0000004594   2008-07-01
CUST0000005207   2007-06-22
CUST0000005379   2008-06-14
CUST0000005893   2008-04-01
CUST0000005977   2007-11-19
CUST0000006193   2007-11-10
CUST0000006298   2008-03-02
CUST0000006485   2008-02-15
CUST0000006666   2008-05-19
CUST0000007392   2008-06-05
CUST0000007501   2008-06-26
CUST0000007712   2008-06-01
CUST0000007759   2008-01-06
CUST0000007960   2008-03-31
                    ...
CUST0000995409   2007-08-20
CUST0000996042   2008-06-01
CUST0000996170   2008-07-04
CUST0000996460   2008-07-05
CUST0000996753   2008-07-01
CUST0000996827   2007-01-29
CUST0000996831   2007-10-20
CUST0000996860   2008-07-06
CUST0000996878   2008-07-03
CUST0000997078   2007-07-25
CUST0000997122   2008-07-02
CUST0000997159   2008-05-02
CUST0000997232   2007-02-04
CUST0000997274   2007-10-29
CUST0000997461   2007-08-20
CUST0000997577   2008-05-26
CUST0000997635   2008-06-29
CUST0000997743   2008-06-28
CUST0000997871   2008-06-29
CUST0000998049   2007-02-16
CUST0000998299   2007-07-11
CUST0000998450   2008-04-08
CUST0000998703   2008-05-23
CUST0000998737   2008-02-03
CUST0000999128   2008-06-09
CUST0000999439   2008-07-05
CUST0000999544   2007-03-23
CUST0000999593   2008-04-02
CUST0000999935   2008-06-05
CUST0000999936   2008-04-17
Name: SHOP_DATE, Length: 4891, dtype: datetime64[ns]

In [10]:
type(df2)

pandas.core.series.Series

In [11]:
df3 = pd.DataFrame(df2).rename(columns={"SHOP_DATE": "Last_visit"})

In [12]:
df3.head()

               Last_visit
CUST_CODE
CUST0000000107 2008-03-25
CUST0000000369 2008-07-05
CUST0000001388 2008-04-11
CUST0000002302 2008-07-03
CUST0000002637 2008-05-30

In [13]:
df3["Total_visit"] = df.groupby('CUST_CODE').BASKET_ID.nunique()

In [14]:
df3.head()

               Last_visit  Total_visit
CUST_CODE
CUST0000000107 2008-03-25            1
CUST0000000369 2008-07-05          126
CUST0000001388 2008-04-11            4
CUST0000002302 2008-07-03           71
CUST0000002637 2008-05-30            7

In [15]:
df3["Total_spend"] = df.groupby('CUST_CODE').SPEND.sum()

In [16]:
df3.head()

               Last_visit  Total_visit  Total_spend
CUST_CODE
CUST0000000107 2008-03-25            1         0.80
CUST0000000369 2008-07-05          126       545.17
CUST0000001388 2008-04-11            4        21.90
CUST0000002302 2008-07-03           71       492.84
CUST0000002637 2008-05-30            7        48.50

## Exercise

1. create new column as average monthly visit
      - average monthly visit = Total visit / no. of active month
   
   
2. create new column as average monthly spend
      - average monthly spend = Total spend / no. of active month
      

3. create new column as average basket size
      - average basket size = Total spend / no. of basket
      

4. if you have time available, create your own columns

**Hint:**

In [ ]:
df['YEAR'] = df['SHOP_DATE'].dt.year

In [ ]:
df['MONTH'] = df['SHOP_DATE'].dt.month

In [ ]:
df['YEAR_MONTH'] = df['SHOP_DATE'].apply(lambda x: x.strftime('%Y-%m'))

## More Questions
1.How many members?

2.How much each store sales?

3.Which item was the most popular by quantity?

4.Which member had the highest sum spend?

5.How many members who spend more than 100 in 2007?

6.How much average spend each hour?

7.How many days that has sum spend more than 3000?

8.What date has sum spend more than 4000 and how much sum spend each date?

In [ ]:
#1

In [ ]:
#2

In [ ]:
#3

In [ ]:
#4

In [ ]:
#5

In [ ]:
#6

In [ ]:
#7

In [ ]:
#8